# 레디스의 자료구조 소개

---

레디스의 자료 구조의 종류와 특징 및 각 자료 구조에서 사용할 수 있는 커맨드에 대해 알아보고 레디스에서 키는 어떻게 다뤄지는지 정리한 글입니다.

# STRING 자료구조

---

**특징**

- 레디스의 String에는 최대 512MB의 문자열 데이터를 저장할 수 있다.
- 이진 데이터를 포함하는 모든 종류의 문자열이 binary-safe하게 처리된다.
    - 즉 JPEG 이미지와 같은 바이트값 HTTP 응답값 등의 다양한 데이터를 저장하는 것이 가능
- 키와 실제 저장되는 아이템이 일대일로 연결되는 유일한 자료구조
    - String이 아닌 다른 자료 구조에서는 하나의 키에 여러 개의 아이템이 저장된다.

### 데이터 저장 및 조회

```bash
> SET hello world
OK

> GET hello
"world"
```

- SET 커맨드는 string 데이터를 저장하며, GET 커맨드는 저장된 string 데이터를 조회 할 수 있다.
- 만약 이미 존재하는 키와 값이 있다면 기존 값은 새로 입력된 값으로 대체된다.
    - string 형태가 아닌 다른 자료구조라도 key에 value가 덮어씌워짐

### 지정한 키가 없을 때에만 새로운 키와 값 추가

```bash
> SET hello newvalue NX
(nil)
```

- 이미 존재하는 key가 있다면 저장되지 않는다.

### 키가 이미 있을 때에만 새로운 값으로 덮어 쓰기

```bash
> SET hello newvalue XX
OK

> GET hello
"newvalue"
```

### 숫자 형태의 데이터 조작

```bash
> SET counter 100
OK

> INCR counter
(integer) 101

> INCR counter
(integer) 102

> INCR counter 50
(integer) 152
```

- 숫자 형태의 데이터는 INCR, INCRBY와 같은 커맨드를 이용하면 원자적으로 조작할 수 있다.
- `원자적`이라는 것은 같은 키에 접근하는 여러 클라이언트가 경쟁 상태를 발생시킬 일이 없음을 의미한다. 커맨드를 수행하는 타이밍이나 순서에 따라 이미 실행한 커맨드가 무시되거나 같은 커맨드가 중복 처리돼 수행 결과가 달라지는 일은 발생하지 않음을 뜻한다.

### 한 번에 여러 키를 조작

```bash
> MSET a 10 b 20 c 30
OK

> MGET a b c
1) "10"
2) "20"
3) "30"
```

- MSET, MGET과 같은 커맨드를 적절하게 사용해 네트워크 통신 시간을 줄인다면 전반적으로 서비스의 응답 속도를 확실하게 향상시킬 수 있게 된다.

# LIST 자료구조

---

**특징**

- 레디스에서 list는 순서를 가지는 문자열의 목록
- 하나의 list에 42억개의 아이템을 저장할 수 있다.
- 인덱스로 접근도 가능하지만, 주로 스택과 큐로 사용된다.

### LIST 데이터 조작

```bash
> LPUSH mylist E
(integer) 1

> RPUSH mylist B
(integer) 2

> LPUSH mylist D A C B A
(integer) 7

> LRANGE mylist 0 -1
1) "A"
2) "B"
3) "C"
4) "A"
5) "D"
6) "E"
7) "B"

> LRANGE mylist 0 3
1) "A"
2) "B"
3) "C"
4) "A"
```

- LPUSH 커맨드는 list의 왼쪽에 데이터를 추가하며, RPUSH 커맨드는 list의 오른쪽에 데이터를 추가한다.
- LRANGE 커맨드를 이용하면 list에 들어 있는 데이터를 조회할 수 있다.

```bash
> LPOP mylist
"A"

> LPOP mylist 2
1) "B"
2) "C"
```

- LPOP 왼쪽에서 아이템 꺼내면서 삭제
- RPOP 오른쪽에서 아이템 꺼내면서 삭제

```bash
> LTRIM mylist 0 1

> LPUSH logdata <data>
> LTRIM logdata 0 999
```

- 0 ~ 1 인덱스 범위에 속하지 않으면 모두 삭제
- > LTRIM logdata 0 999 이 부분은 최대 1000개의 로그를 보관할 수 있도록 함께 활용하는 명령어
